<!-- Original URL: http://khigiacmoquayve.narod.ru/vietbook/linux/slackware/startslack.html -->
<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <meta http-equiv="content-type"
 content="text/html; charset=ISO-8859-1">
  <title>startslack</title>
</head>
<body>
<span style="font-style: italic;">Ki&#7871;n Th&#7913;c C&#417; B&#7843;n Slackware Linux</span><br>
<hr> <big><big style="font-weight: bold;"> Ch&#432;&#417;ng 2 M&#7903; &#273;&#7847;u v&#7873; Slackware
Linux<br>
</big></big><br>
<a name="ch_2.1.1"><big><span style="font-weight: bold;"><small>2.1.1
Linux l&agrave; g&igrave;?</small><br>
</span></big><br>
N&#259;m 1991,Linux &#273;&#432;&#7907;c b&#7855;t &#273;&#7847;u t&#7915; Linus Torvalds nh&#432; m&#7897;t phi&ecirc;n b&#7843;n
&#273;&#7847;u ti&ecirc;n.Linus th&#7917; t&igrave;m c&aacute;ch kh&#7903;i &#273;&#7897;ng h&#7879; th&#7889;ng Unix
kh&ocirc;ng c&#7847;n tr&#7843; ti&#7873;n.C&ugrave;ng v&#7899;i &#273;i&#7873;u &#273;&oacute; anh &#7845;y mu&#7889;n h&#7885;c
m&#7897;t c&aacute;ch chi ti&#7871;t c&aacute;ch v&agrave;o/ra c&#7911;a
386-processor.Nh&#7919;ng c&aacute;i g&igrave; nh&#7853;n &#273;&#432;&#7907;c Linus &#273;&#432;a ra mi&#7877;n
ph&iacute; &#7903; trong c&aacute;c terminal GNU General Public License(xem &#7903;
2.1.3) &#273;&#7875; s&#7917; d&#7909;ng v&#7899;i m&atilde; g&#7889;c cho t&#7845;t c&#7843; nh&#7919;ng ng&#432;&#7901;i s&#7917; d&#7909;ng.<br>
<br>
Ng&agrave;y nay Linux chi&#7871;m &#273;&#432;&#7907;c m&#7897;t v&#7883; tr&iacute; l&#7899;n trong th&#7883; tr&#432;&#7901;ng
H&#272;H.N&oacute; c&oacute; th&#7875; l&agrave;m vi&#7879;c tr&ecirc;n m&#7897;t s&#7889; l&#432;&#7907;ng l&#7899;n
c&aacute;c d&#7841;ng Processor,bao g&#7891;m Compaq-Alpha,Sun SPARC,Ultra SPARC
v&agrave; c&#7843; Motorola PowerPC(v&iacute; d&#7909; nh&#432; Aple Macintosh v&agrave;
IBM RS/6000).Linux &#273;&#432;&#7907;c ho&agrave;n thi&#7879;n b&#7903;i h&agrave;ng tr&#259;m n&#7871;u
kh&ocirc;ng ph&#7843;i l&agrave; h&#7857;ng ngh&igrave;n c&aacute;c nh&agrave; l&#7853;p
tr&igrave;nh t&#7915; tr&ecirc;n kh&#7855;p th&#7875; gi&#7899;i.&#7902; trong n&oacute; l&agrave;m
vi&#7879;c c&aacute;c ch&#432;&#417;ng tr&igrave;nh nh&#432; Sendmail,Apache v&agrave;
BIND,m&agrave; &#273;&#432;&#7907;c coi l&agrave; ph&#7893; bi&#7871;n tr&ecirc;n c&aacute;c server
v&agrave; internet.<br>
<br>
Tr&ecirc;n th&#7921;c t&#7871;&nbsp; thu&#7853;t ng&#7919; linux d&ugrave;ng &#273;&#7875; ch&#7881; cho
nh&acirc;n h&#7879; th&#7889;ng - Trung t&acirc;m c&#7911;a H&#272;H.Nh&acirc;n s&#7869; &#273;i&#7873;u khi&#7875;n
processor,&#273;&#297;a c&#7913;ng,b&#7897; nh&#7899;,v&agrave; c&aacute;c b&#7897; ph&#7853;n ngo&#7841;i vi
kh&aacute;c.Th&#7921;c t&#7871; th&igrave; &#273;&oacute; l&agrave; t&#7845;t c&#7843; nh&#7919;ng
g&igrave; m&agrave; Linux l&agrave;m vi&#7879;c.N&oacute; ki&#7875;m so&aacute;t
c&ocirc;ng vi&#7879;c c&#7911;a m&aacute;y t&iacute;nh,theo r&otilde;i ho&#7841;t &#273;&#7897;ng c&#7911;a
c&aacute;c ch&#432;&#417;ng tr&igrave;nh.T&#7845;t c&#7843; c&aacute;c ch&#432;&#417;ng tr&igrave;nh
tr&ecirc;n Linux ho&#7841;t &#273;&#7897;ng kh&ocirc;ng ph&#7909; thu&#7897;c v&agrave;o
nhau.Nh&acirc;n v&agrave; ch&#432;&#417;ng tr&igrave;nh c&oacute; li&ecirc;n quan
&#273;&#7871;n nh&#7919;ng h&atilde;ng v&agrave; nh&oacute;m ng&#432;&#7901;i kh&aacute;c nhau &#273;&#7875;
t&#7841;o l&ecirc;n H&#272;H.Ch&uacute;ng ta g&#7885;i n&oacute; l&agrave; distribution
Linux.<br>
<br>
</a><a name="ch_2.1.2"><big><span style="font-weight: bold;"><small>2.1.2
Slackware l&agrave; g&igrave;</small><br>
</span></big><br>
Slackware l&agrave; distribution Linux &#273;&#7847;u ti&ecirc;n &#273;&#432;&#7907;c ph&#7893; bi&#7871;n
r&#7897;ng l&#7899;n.N&oacute; &#273;&#432;&#7907;c b&#7855;t &#273;&#7847;u b&#7903;i Patrick Volkerding v&agrave;o cu&#7889;i
n&#259;m 1992.Patrick l&agrave;m quen v&#7899;i Linux trong khi t&igrave;m ki&#7871;m m&#7897;t
b&#7897; d&#7883;ch kh&ocirc;ng &#273;&#7855;t cho LISP cho k&#7871; ho&#7863;c c&#7911;a m&igrave;nh.C&#361;ng trong
th&#7901;i gian &#273;&#7845;y t&#7891;n t&#7841;i m&#7897;t v&agrave;i distribution v&agrave; Patrick
&#273;&atilde; ch&#7885;n distribution SLS Linux(Soft Landing Systems)<br>
<br>
Tuy nhi&ecirc;n SLS Linux c&oacute; nh&#7919;ng v&#7845;n &#273;&#7873; c&#7911;a m&igrave;nh
v&agrave; Patrick b&#7855;t &#273;&#7847;u s&#7917;a l&#7841;i nh&#7919;ng l&#7895;i nh&#7887; m&agrave; t&igrave;m
&#273;&#432;&#7907;c.Trong gi&#7899;i h&#7841;n thu &#273;&#432;&#7907;c Patrick quy&#7871;t &#273;&#7883;nh li&ecirc;n k&#7871;t t&#7845;t c&#7843;
nh&#7919;ng g&igrave; m&igrave;nh s&#7917;a &#273;&#432;&#7907;c v&agrave;o m&#7897;t distribution
ri&ecirc;ng c&#7911;a m&igrave;nh &#273;&#7875; cho b&#7843;n th&acirc;n v&agrave; b&#7841;n
b&egrave; s&#7917; d&#7909;ng.Phi&ecirc;n b&#7843;n &#273;&atilde; nhanh ch&oacute;ng &#273;&#432;&#7907;c ph&#7893;
bi&#7871;n v&agrave; Patrick &#273;&atilde; quy&#7871;t &#273;&#7883;nh g&#7917;i l&ecirc;n tr&ecirc;n
internet v&#7899;i c&aacute;i t&ecirc;n Slackware.<br>
<br>
Patrick c&#361;ng b&#7893; sung th&ecirc;m b&#7889;n distributions n&#7919;a.Nh&#432; l&agrave;
c&aacute;c ch&#432;&#417;ng tr&igrave;nh c&agrave;i &#273;&#7863;t v&#7899;i interface th&acirc;n
thi&#7879;n,c&aacute;c h&#7879; th&#7889;ng menu v&agrave; t&#7853;p h&#7907;p c&aacute;c packages
c&ocirc;ng c&#7909; &#273;i&#7873;u khi&#7875;n.N&oacute; gi&uacute;p cho ng&#432;&#7901;i s&#7917; d&#7909;ng d&#7877;
d&agrave;ng b&#7893; sung,x&oacute;a b&#7887;,c&#7853;p nh&#7853;t c&aacute;c packages.<br>
<br>
</a><a name="ch_2.1.3"><big><span style="font-weight: bold;"><small>2.1.3
Ch&#432;&#417;ng tr&igrave;nh &#7913;ng d&#7909;ng v&#7899;i m&atilde; m&#7903;(Open Source) v&agrave;
c&aacute;c ch&#432;&#417;ng tr&igrave;nh t&#7921; do(Free Software)</small><br>
</span></big><br>
B&ecirc;n trong Linux c&oacute; hai khuynh h&#432;&#7899;ng &#273;i&#7873;u khi&#7875;n c&aacute;c
ch&#432;&#417;ng tr&igrave;nh &#7913;ng d&#7909;ng.Chi&#7873;u h&#432;&#7899;ng c&#7911;a Free Software(m&agrave;
ch&uacute;ng ta s&#7869; n&oacute;i v&#7873; n&oacute; sau) l&agrave; ph&aacute;t
tri&#7875;n c&aacute;c ch&#432;&#417;ng tr&igrave;nh kh&ocirc;ng h&#7841;n ch&#7871; kh&#7843; n&#259;ng
s&aacute;ng t&#7841;o c&aacute; nh&acirc;n,theo h&#7885; th&igrave; n&oacute; &#273;&#7841;t
&#273;&#432;&#7907;c tr&igrave;nh &#273;&#7897; k&#297; thu&#7853;t cao v&agrave; &#273;i ng&#432;&#7907;c ch&#7889;ng l&#7841;i c&#7897;ng
&#273;&#7891;ng.C&ograve;n &#273;&#7883;nh h&#432;&#7899;ng c&#7911;a Open Source l&agrave; l&agrave;m vi&#7879;c &#273;&#7875;
&#273;&#7841;t &#273;&#432;&#7907;c c&aacute;c m&#7909;c ti&ecirc;u c&#7911;a c&#7897;ng &#273;&#7891;ng,v&agrave; t&#7845;t
nhi&ecirc;n &#273;&#432;&#7907;c ph&aacute;t h&agrave;nh cho c&#7897;ng &#273;&#7891;ng nh&#7919;ng ng&#432;&#7901;i s&#7917;
d&#7909;ng mi&#7877;n ph&iacute; &#7903; d&#7841;ng m&atilde; g&#7889;c.N&oacute; kh&aacute;c h&#7859;n so
v&#7899;i nh&#7919;ng quy t&#7855;c truy&#7873;n th&#7889;ng m&agrave; &#273;i&#7873;u khi&#7875;n Free Software<br>
<br>
Nh&#7919;ng t&#7893; ch&#7913;c &#273;&#7841;i di&#7879;n cho Free Software nh&#432; l&agrave; FSF(Free
Software Foundation) - L&agrave; t&#7893; ch&#7913;c t&agrave;i tr&#7907; cho k&#7871; ho&#7841;ch
GNU.Free Sofware - l&agrave; m&#7897;t&nbsp; &yacute; t&#432;&#7903;ng l&#7899;n.M&#7897;t c&acirc;u
hay &#273;&#432;&#7907;c s&#7917; d&#7909;ng l&agrave;:"T&#7921; do ng&ocirc;n ng&#7919;,bia ph&#7843;i tr&#7843; ti&#7873;n".C&#361;ng
nh&#432; tr&ecirc;n,Free Software&nbsp; - &#273;&oacute; l&agrave; th&#7917; nghi&#7879;m b&#7843;o
v&#7879; nh&#7919;ng quy&#7873;n nh&#7845;t &#273;&#7883;nh c&#7911;a t&aacute;c gi&#7843; c&#361;ng nh&#432; ng&#432;&#7901;i
d&ugrave;ng.S&#7921; t&#7921; do &#7845;y bao g&#7891;m trong c&#7843; b&#7843;n th&acirc;n v&agrave; trong
s&#7917; d&#7909;ng c&aacute;c ch&#432;&#417;ng tr&igrave;nh cho c&aacute;c m&#7909;c &#273;&iacute;ch
kh&aacute;c nhau,t&#7921; do trong h&#7885;c t&#7853;p v&agrave; bi&#7871;n &#273;&#7893;i c&aacute;c
m&atilde; g&#7889;c,t&#7921; do cho ph&eacute;p nh&#7919;ng ng&#432;&#7901;i &#273;am m&ecirc; c&oacute;
th&#7875; truy c&#7853;p v&agrave; bi&#7871;n &#273;&#7893;i.&#272;&#7875; th&#7921;c hi&#7879;n &#273;&#432;&#7907;c c&aacute;c m&#7913;c &#273;&#7897; t&#7921;
do &#7845;y &#273;&atilde; h&igrave;nh th&agrave;nh l&ecirc;n t&#7893; ch&#7913;c GNU&nbsp;
General Public License (GPL).GPL kh&#7859;ng &#273;&#7883;nh r&#7857;ng,t&#7845;t c&#7843; nh&#7919;ng ai g&#7917;i
l&ecirc;n m&#7897;t ch&#432;&#417;ng tr&igrave;nh &#273;&atilde; &#273;&#432;&#7907;c bi&ecirc;n d&#7883;ch,theo
gi&#7845;y ph&eacute;p &#273;&#259;ng k&iacute; GPL th&igrave; nh&#7845;t &#273;&#7883;nh ph&#7843;i g&#7917;i c&#7843;
m&atilde; g&#7889;c l&ecirc;n,v&agrave; b&#7845;t c&#7913; m&#7897;t ng&#432;&#7901;i n&agrave;o c&#361;ng
c&oacute; th&#7875; bi&#7871;n &#273;&#7893;i &#273;&#432;&#7907;c ch&#432;&#417;ng tr&igrave;nh,khi &#7845;y nh&#7919;ng bi&#7871;n &#273;&#7893;i &#7845;y
c&#361;ng &aacute;p d&#7909;ng &#273;&#432;&#7907;c v&#7899;i m&atilde; g&#7889;c.&#272;i&#7873;u n&agrave;y &#273;&#7843;m b&#7843;o
r&#7857;ng:M&#7897;t khi ch&#432;&#417;ng tr&igrave;nh &#273;&atilde; &#273;&#432;&#7907;c m&#7903; cho c&#7897;ng &#273;&#7891;ng
th&igrave; n&oacute; kh&ocirc;ng th&#7875; &#273;&oacute;ng v&agrave;o &#273;&#432;&#7907;c,ngo&#7841;i
tr&#7915; tr&#432;&#7901;ng h&#7907;p t&aacute;c gi&#7843; bi&#7871;n &#273;&#7893;i m&atilde; g&#7889;c t&#7915;ng phi&ecirc;n
b&#7843;n.H&#7847;u nh&#432; c&aacute;c ch&#432;&#417;ng tr&igrave;nh trong Linux &#273;&#432;&#7907;c c&#7845;p gi&#7845;y
ph&eacute;p GPL.<br>
<br>
C&oacute; l&#7869; b&#7841;n kh&ocirc;ng nh&#7853;n th&#7845;y r&#7857;ng GPL kh&ocirc;ng n&oacute;i
&#273;&#7871;n gi&aacute; c&#7911;a ch&#432;&#417;ng tr&igrave;nh.Th&#7853;t l&agrave; l&#7841;,B&#7841;n c&oacute;
th&#7875; nh&#7853;n &#273;&#432;&#7907;c ti&#7873;n nh&#7901; c&aacute;c Free Software.&#7902; &#273;&acirc;y "Free"
c&oacute; ngh&#297;a l&agrave; ph&#7843;i tr&#7843; ti&#7873;n cho nh&#7919;ng h&agrave;nh &#273;&#7897;ng t&#7921; do
tr&ecirc;n m&atilde; g&#7889;c &agrave; kh&ocirc;ng ph&#7843;i l&agrave; gi&aacute;
cho ch&#432;&#417;ng tr&igrave;nh m&agrave; b&#7841;n ph&#7843;i tr&#7843;.(Tuy nhi&ecirc;n ai
&#273;&oacute; b&aacute;n ho&#7863;c t&#7863;ng cho b&#7841;n ch&#432;&#417;ng tr&igrave;nh &#273;&atilde;
bi&ecirc;n d&#7883;ch d&#432;&#7899;i gi&#7845;y ph&eacute;p GPL th&igrave; ng&#432;&#7901;i &#273;&oacute;
c&#361;ng nh&#7845;t &#273;&#7883;nh ph&#7843;i &#273;&#432;a ra b&#7857;ng m&atilde; g&#7889;c)<br>
<br>
Tr&ecirc;n th&#7921;c t&#7871; &#273;&#7883;nh h&#432;&#7899;ng Open Source t&#7891;n t&#7841;i &#273;&#7847;u ti&ecirc;n.Open
Source Initiative(OSI) coi l&agrave; t&#7893; ch&#7913;c lo&#7841;i b&#7887; s&#7921; &#273;&#7843;m b&#7843;o v&#7873; m&#7903;
m&atilde; g&#7889;c.C&oacute; ngh&#297;a l&agrave; c&aacute;c ch&#432;&#417;ng tr&igrave;nh
m&agrave; c&oacute; th&#7875; truy c&#7853;p v&agrave;o m&atilde; g&#7889;c c&#361;ng nh&#432;
c&aacute;c phi&ecirc;n b&#7843;n &#273;&#432;&#7907;c ph&aacute;t h&agrave;nh,ch&uacute;ng
kh&ocirc;ng c&#7847;n m&#7897;t lo&#7841;i gi&#7845;y ph&eacute;p &#273;&#7863;c bi&#7879;t tuy nhi&ecirc;n thay
v&agrave;o &#273;&#7845;y n&oacute; c&oacute; nh&#7919;ng lo&#7841;i gi&#7845;y ph&eacute;p
kh&aacute;c nhau &#273;&#7875; cho ph&eacute;p m&#7903; m&atilde; g&#7889;c.<br>
<br>
&yacute; t&#432;&#7903;ng &#273;&#7913;ng sau&nbsp; OSI - Ph&aacute;t tri&#7875;n c&aacute;c
h&atilde;nh b&#7857;ng h&#7871;t s&#7913;c m&igrave;nh v&agrave; cho ph&eacute;p m&#7895;i
h&atilde;ng c&oacute; gi&#7845;y ph&eacute;p ri&ecirc;ng c&#7911;a m&igrave;nh cho
c&aacute;c ch&#432;&#417;ng tr&igrave;nh c&#7911;a m&igrave;nh v&agrave; gi&#7845;y ch&#7913;ng nh&#7853;n
c&aacute;c gi&#7845;y ph&eacute;p &#7845;y c&#7911;a OSI. C&oacute; r&#7845;t nhi&#7873;u h&atilde;ng
mu&#7889;n g&#7917;i m&atilde; g&#7889;c l&ecirc;n nh&#432;ng h&#7885; kh&ocirc;ng mu&#7889;n s&#7917; d&#7909;ng
GPL.C&oacute; l&#7869; h&#7885; kh&ocirc;ng th&#7875; thay &#273;&#7893;i &#273;&#432;&#7907;c GPL,&#273;&#7875; h&#7885; c&oacute;
th&#7875; c&oacute; gi&#7845;y ph&eacute;p ri&ecirc;ng c&#7911;a m&igrave;nh v&agrave;
gi&#7845;y ch&#7913;ng nh&#7853;n c&#7911;a t&#7893; ch&#7913;c.<br>
<br>
Open Source v&agrave; Free Software&nbsp; c&oacute; th&#7875; n&oacute;i &#273;i
c&ugrave;ng m&#7897;t h&#432;&#7899;ng m&agrave; l&#7841;i kh&ocirc;ng c&ugrave;ng.FSF s&#7917; d&#7909;ng
m&#7897;t lo&#7841;i gi&#7845;y ph&eacute;p ri&ecirc;ng v&agrave; g&#7917;i c&aacute;c ch&#432;&#417;ng
tr&igrave;nh d&#432;&#7899;i gi&#7845;y ph&eacute;p n&agrave;y.OSI t&igrave;m ki&#7871;m h&#7871;t
t&#7845;t c&#7843; c&aacute;c lo&#7841;i gi&#7845;y ph&eacute;p s&#7917; d&#7909;ng bao g&#7891;m c&#7843; FSF.Nh&#7913;ng y&#7871;u
t&#7889; ch&iacute;nh tr&ecirc;n con &#273;&#432;&#7901;ng d&#7921; do g&#7917;i m&atilde; g&#7889;c &#273;&#432;&#7907;c chia
th&agrave;nh hai h&#432;&#7899;ng kh&aacute;c nhau,nh&#432;ng ch&iacute;nh v&#7851;n l&agrave;
hai &yacute; t&#432;&#7903;ng c&#7911;a nh&#7919;ng nh&oacute;m l&agrave;m vi&#7879;c kh&aacute;c
nhau,tr&ecirc;n c&ugrave;ng m&#7897;t con &#273;&#432;&#7901;ng &#273;&#7875; &#273;&#7841;t &#273;&#432;&#7907;c m&#7909;c &#273;&iacute;ch
l&agrave; t&#7841;o ra s&#7921; tin t&#432;&#7903;ng trong c&aacute;c cu&#7897;c th&#7917; nghi&#7879;m.<br>
<br>
</a><a name="ch_2.2"><big><span style="font-weight: bold;"><small>2.2
Nh&#7853;n &#273;&#432;&#7907;c s&#7921; &#273;&#7843;m b&#7843;o v&agrave; gi&uacute;p &#273;&#7905;</small><br>
</span></big><br>
Th&ocirc;ng th&#432;&#7901;ng trong qu&aacute; tr&igrave;nh s&#7917; d&#7909;ng,b&#7841;n c&#7847;n ph&#7843;i
c&oacute; nh&#7919;ng h&#432;&#7899;ng d&#7851;n s&#7917; d&#7909;ng c&aacute;c l&#7879;nh,c&agrave;i &#273;&#7863;t
c&aacute;c ch&#432;&#417;ng tr&igrave;nh c&#361;ng nh&#432; k&#7871;t c&#7845;u c&aacute;c thi&#7871;t b&#7883;.Th&#7853;t
l&agrave; tuy&#7879;t v&#7901;i b&#7901;i v&igrave; c&oacute; r&#7845;t nhi&#7873;u c&aacute;ch &#273;&#7875;
c&oacute; th&#7875; l&#7845;y &#273;&#432;&#7907;c c&aacute;c th&ocirc;ng tin c&#7847;n thi&#7871;t.N&#7871;u b&#7841;n
c&agrave;i c&aacute;c packages t&#7915; khu v&#7921;c ch&#432;&#417;ng tr&igrave;nh F
th&igrave; b&#7841;n s&#7869; c&oacute; m&#7897;t t&#7853;p h&#7907;p th&ocirc;ng tin r&#7897;ng l&#7899;n c&#7847;n
thi&#7871;t.C&aacute;c ch&#432;&#417;ng tr&igrave;nh c&#361;ng &#273;&#432;&#7907;c l&#7891;ng v&agrave;o
c&aacute;c ph&#7847;n h&#432;&#7899;ng d&#7851;n &#273;&#7875;&nbsp; ti&#7879;n trong qu&aacute; tr&igrave;nh s&#7917;
d&#7909;ng.V&agrave; cu&#7889;i c&ugrave;ng h&atilde;y s&#7917; d&#7909;ng website Slackware &#273;&#7875;
l&#7845;y th&ocirc;ng tin.<br>
<br>
</a><a name="ch_2.2.1"><span style="font-weight: bold;">2.2.1 Ph&#432;&#417;ng
ph&aacute;p l&#7845;y help(s&#7921; gi&uacute;p &#273;&#7905;)</span><br>
<span style="font-weight: bold;"> man </span><br>
<span style="font-weight: bold;"> man</span> (manual - s&#7893; tay) n&oacute;
l&agrave; ph&#432;&#417;ng ph&aacute;p truy&#7873;n th&#7889;ng l&#7845;y help trong Unix v&agrave;
Linux.C&aacute;c t&#7853;p tin &#273;&#432;&#7907;c &#273;&#7883;nh d&#7841;ng m&#7897;t c&aacute;ch &#273;&#7863;c bi&#7879;t - "<span
 style="font-weight: bold;">man pages</span>" ch&#7913;a c&aacute;c
th&ocirc;ng tin c&oacute; li&ecirc;n quan t&#7899;i c&aacute;c c&acirc;u
l&#7879;nh,v&agrave; &#273;&#432;&#7907;c c&agrave;i c&ugrave;ng ch&#432;&#417;ng
tr&igrave;nh.H&atilde;y th&#7921;c hi&#7879;n man &lt;t&ecirc;n l&#7879;nh&gt;,sau
&#273;&oacute; tr&ecirc;n m&agrave;n h&igrave;nh s&#7869; hi&#7875;n th&#7883; c&aacute;c
th&ocirc;ng tin c&oacute; li&ecirc;n quan &#273;&#7871;n c&acirc;u l&#7879;nh(n&#7871;u
c&oacute;)<br>
<br>
T&#7891;n t&#7841;i m&#7897;t kh&#7889;i l&#432;&#7907;ng kh&#7893;ng l&#7891; c&aacute;c man pages v&agrave;
ch&uacute;ng &#273;&#432;&#7907;c chia th&agrave;nh c&aacute;c nh&oacute;m nh&#7887;.S&#7921; chia
n&agrave;y &#273;&#432;&#7907;c th&#7921;c hi&#7879;n r&#7845;t l&acirc;u r&#7891;i.Ch&iacute;nh v&igrave; th&#7871; &#7903;
&#273;&acirc;u b&#7841;n g&#7863;p c&aacute;c link &#273;&#7871;n c&aacute;c trang th&igrave; b&#7841;n s&#7869;
nh&igrave;n th&#7845;y s&#7889; c&#7911;a c&aacute;c nh&oacute;m v&agrave; trang man
n&agrave;y tr&#7921;c thu&#7897;c.V&iacute; d&#7909; b&#7841;n nh&igrave;n th&#7845;y <span
 style="font-weight: bold;">man(1)</span>.<br>
N&oacute; cho b&#7841;n bi&#7871;t r&#7857;ng l&#7879;nh man &#273;&#432;&#7907;c ghi &#7903; ph&#7847;n 1 c&#7911;a ph&#7847;n
c&aacute;c l&#7879;nh cho ng&#432;&#7901;i s&#7917; d&#7909;ng(user commands).B&#7841;n c&oacute; th&#7875; ch&#7881;
ra c&aacute;i g&igrave; m&agrave; b&#7841;n mu&#7889;n xem &#273;&#7889;i v&#7899;i trang man t&#7915; ph&#7847;n
1 cho l&#7879;nh man,h&atilde;y s&#7917; d&#7909;ng <span style="font-weight: bold;">man
1 man</span>.<br>
<br>
S&#7921; ch&#7881; ra s&#7889; k&iacute; hi&#7879;u c&#7911;a v&ugrave;ng m&agrave; b&#7841;n mu&#7889;n
t&igrave;m ki&#7871;m t&agrave;i li&#7879;u c&oacute; l&#7869; r&#7845;t c&oacute; &iacute;ch
l&#7907;i khi b&#7841;n ph&#7843;i t&igrave;m ki&#7871;m c&aacute;c l&#7879;nh v&#7899;i c&aacute;c ch&#7913;c
n&#259;ng kh&aacute;c nhau nh&#432;ng c&ugrave;ng t&ecirc;n.<br>
<br>
<span style="font-weight: bold;"> Khu
v&#7921;c&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
n&#7897;i dung<br>
</span><br>
khu v&#7921;c
1&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
user commands<br>
khu v&#7921;c
2&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
g&#7885;i h&#7879; th&#7889;ng<br>
khu v&#7921;c
3&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
g&#7885;i th&#432; vi&#7879;c C<br>
khu v&#7921;c
4&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
thi&#7871;t b&#7883;<br>
khu v&#7921;c
5&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
&#273;&#7883;nh d&#7841;ng t&#7853;p tin v&agrave; protocol<br>
khu v&#7921;c
6&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
games<br>
khu v&#7921;c
7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
tho&#7843; thu&#7853;n,macro packages<br>
khu v&#7921;c
8&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
h&#7879; th&#7889;ng administrators<br>
<br>
C&ugrave;ng v&#7899;i man(1) c&ograve;n c&oacute; c&aacute;c l&#7879;nh nh&#432; <span
 style="font-weight: bold;">whatis(1)</span> v&agrave;&nbsp; <span
 style="font-weight: bold;">apropos(1)</span> m&agrave; &#273;&#432;&#7907;c t&#7841;o ra &#273;&#7847;u
ti&ecirc;n &#273;&#7875; gi&uacute;p &#273;&#7905; <span style="font-weight: bold;">man</span>
trong q&uacute;a tr&igrave;nh t&igrave;m ki&#7871;m.<br>
<br>
<span style="font-weight: bold;"> whatis</span> &#273;&#432;a ra nh&#7919;ng th&ocirc;ng
tin ng&#7855;n g&#7885;n v&#7873; h&#7879; th&#7889;ng c&acirc;u l&#7879;nh,&#273;&oacute; l&agrave; nh&#7919;ng
c&aacute;i gi g&#7855;n g&#7885;n trong s&#7893; tay v&#7873; c&aacute;ch c&acirc;u l&#7879;nh h&#7879;
th&#7889;ng.<br>
<span style="font-weight: bold;"> apropos</span> th&igrave; bi&#7871;n nh&#7919;ng
k&#7871;t qu&#7843; t&igrave;m &#273;&#432;&#7907;c c&#7911;a man th&agrave;nh c&aacute;c t&#7915; kho&aacute;.<br>
H&atilde;y xem nh&#7919;ng trang man &#273;&#7875; c&oacute; th&ecirc;m th&ocirc;ng tin<br>
<span style="font-weight: bold;"> Catalog </span><span
 style="font-style: italic;">/usr/doc<br>
</span><br>
C&aacute;c &#273;o&#7841;n v&#259;n b&#7843;n c&#7911;a c&aacute;c ch&#432;&#417;ng tr&igrave;nh m&agrave;
b&#7841;n b&#7893; sung v&agrave;o distribution &#273;&#432;&#7907;c s&#7855;p x&#7871;p v&agrave;o c&ugrave;ng
m&#7897;t lo&#7841;i t&agrave;i li&#7879;u.C&aacute;c t&#7853;p tin README &#273;&#432;&#7907;c s&#7917; d&#7909;ng nh&#432; m&#7863;c
&#273;&#7883;nh,c&aacute;c t&#7853;p tin gi&#7845;y ph&eacute;p,...v&agrave; c&aacute;c lo&#7841;i
t&agrave;i li&#7879;u kh&aacute;c &#273;&#432;&#7907;c &#273;&#7863;t c&ugrave;ng v&#7899;i ch&#432;&#417;ng tr&igrave;nh
g&#7889;c &#273;&#432;&#7907;c c&agrave;i &#273;&#7863;t tr&ecirc;n m&aacute;y c&#7911;a b&#7841;n v&agrave; trong
n&oacute; &#273;&#7873;u n&#7857;m &#7903; /usr/doc<br>
N&#7871;u nh&#432; th&ocirc;ng tin &#273;&#432;a ra b&#7903;i man kh&ocirc;ng &#273;&#7911; th&igrave; b&#7841;n
h&atilde;y xem th&ecirc;m &#7903; /usr/doc<br>
<br style="font-weight: bold;">
<span style="font-weight: bold;"> Howto v&agrave; mini-Howto<br>
</span><br>
<span style="font-weight: bold;"> HOWTO</span>(l&agrave;m nh&#432; th&#7871;
n&agrave;o).Nh&#7919;ng t&agrave;i li&#7879;u n&agrave;y ghi r&otilde; ng&#7855;n g&#7885;n
c&aacute;ch l&agrave;m m&#7897;t vi&#7879;c g&igrave; &#273;&oacute;.N&#7871;u b&#7841;n c&agrave;i
packages v&#7899;i t&#7853;p h&#7907;p howto th&igrave; b&#7841;n c&oacute; th&#7875; t&igrave;m
ch&uacute;ng &#7903; catalog<br>
<br>
&nbsp;/usr/doc/Linux-HOWTOS,c&ograve;n mini-HOWTO &#7903; catalog
/usr/doc/Linux-mini-HOWTOS<br>
<br>
C&#361;ng trong packages n&agrave;y b&#7841;n c&oacute; th&#7875; t&igrave;m th&#7845;y h&#7879;
th&#7889;ng t&agrave;i li&#7879;u FAQ(Nh&#7919;ng c&acirc;u h&#7887;i th&#432;&#7901;ng g&#7863;p) v&agrave; c&#7843;
&#273;&aacute;p &aacute;n cho c&aacute;c c&acirc;u h&#7887;i &#7845;y.<br>
Nh&#7919;ng t&#7853;p tin n&agrave;y r&#7845;t l&agrave; c&oacute; l&#7907;i n&#7871;u nh&#432; b&#7841;n
kh&ocirc;ng tin ch&#7855;c v&agrave;o m&#7897;t vi&#7879;c g&igrave; &#273;&oacute;.<br>
<br>
</a><a name="ch_2.2.2"><span style="font-weight: bold;">2.2.2 Online
Help<br>
</span><br>
C&ugrave;ng v&#7899;i c&aacute;c t&agrave;i li&#7879;u tr&ecirc;n c&oacute; trong
Slackware Linux c&ograve;n c&oacute; nhi&#7873;u c&aacute;ch kh&aacute;c &#273;&#7875;
nh&#7853;n &#273;&#432;&#7907;c s&#7921; tr&#7907; gi&uacute;p &#7903; ch&#7871; &#273;&#7897; online.<br>
<br>
<span style="font-weight: bold;"> Website v&agrave; Forum<br>
</span><br>
<span style="font-weight: bold; font-style: italic;"> www.slackware.com</span><br
 style="font-style: italic;">
<br>
Website ch&iacute;nh Slackware Linux ch&#7913;a &#273;&#7847;y &#273;&#7911; c&aacute;c th&ocirc;ng
tin v&#7873; h&#7879; th&#7889;ng.B&#7841;n c&oacute; th&#7875; t&igrave;m th&#7845;y nh&#7919;ng th&ocirc;ng tin
c&#7847;n thi&#7871;t v&#7873; H&#272;H c&#361;ng nh&#432; c&aacute;c cu&#7889;n s&#7893; tay tr&#7907; gi&uacute;p
c&agrave;i &#273;&#7863;t v&agrave; FAQ c&#361;ng nhi&#7873;u th&ocirc;ng tin b&#7893; &iacute;ch
kh&aacute;c cho nh&#7919;ng ng&#432;&#7901;i v&#7899;i s&#7917; d&#7909;ng ho&#7863;c nhi&#7873;u ng&#432;&#7901;i kh&aacute;c.<br>
<br>
B&#7841;n c&oacute; th&#7875; t&igrave;m tr&ecirc;n forum ph&#7847;n m&agrave; nh&#7919;ng
ng&#432;&#7901;i s&#7917; d&#7909;ng hay trao &#273;&#7893;i kinh nghi&#7879;p s&#7917; d&#7909;ng Slackware v&agrave;
gi&uacute;p &#273;&#7905; l&#7851;n nhau s&#7917; gi&#7843;i quy&#7871;t c&aacute;c v&#7845;n &#273;&#7873;.&#272;&acirc;y
l&agrave; m&#7897;t c&aacute;ch thu nh&#7863;t th&ocirc;ng tin r&#7845;t t&#7889;t,c&#361;ng nh&#432;
l&agrave; th&#7875; hi&#7879;n kinh nhi&#7879;m c&#7911;a m&igrave;nh.N&oacute; &#273;&#432;&#7907;c coi
l&agrave; m&#7897;t bi&#7879;n ph&aacute;p ph&#7893; bi&#7871;n v&agrave; ho&#7841;t
t&iacute;nh.C&oacute; l&#7869; &#273;&#7845;y s&#7869; l&agrave; &#273;i&#7875;m d&#7915;ng ch&acirc;n &#273;&#7847;u
ti&ecirc;n c&#7911;a b&#7841;n tr&ecirc;n con &#273;&#432;&#7901;ng thu nh&#7863;t th&ocirc;ng tin.(Nh&#7919;ng
c&acirc;u h&#7887;i ho&#7863;c tin nh&#7855;n c&#7911;a b&#7841;n &#273;&#432;&#7907;c m&#7903; ra trong m&#7897;t kh&ocirc;ng
gian l&#7899;n,c&oacute; ngh&#297;a l&agrave; kh&#7843; n&#259;ng nh&#7853;n &#273;&#432;&#7907;c &#273;&aacute;p
&aacute;n r&#7845;t l&agrave; cao).H&atilde;y ch&uacute; &yacute;,tr&#432;&#7899;c khi
b&#7841;n &#273;&#432;a ra c&acirc;u h&#7887;i h&atilde;y quan s&aacute;t th&#7853;t k&#297; h&#7871;t
c&aacute;c kh&#7843; n&#259;ng,b&#7903;i v&igrave; &#273;&aacute;p &aacute;n c&oacute; th&#7875;
ngay c&#7841;nh m&agrave; b&#7841;n kh&ocirc;ng &#273;&#7875; &yacute;.<br>
<br>
<span style="font-weight: bold;"> e-mail<br>
</span><br>
T&#7845;t c&#7843; nh&#7919;ng ng&#432;&#7901;i mua CD g&#7889;c &#273;&#7873;u c&oacute; kh&#7843; n&#259;ng nh&#7853;n &#273;&#432;&#7907;c mi&#7877;n
ph&iacute; s&#7921; &#273;&#7843;m b&#7843;o v&#7873; c&agrave;i &#273;&#7863;t qua e-mail.Ch&uacute;ng
t&ocirc;i s&#7869; c&#7889; g&#7855;ng h&#7871;t s&#7913;c gi&uacute;p &#273;&#7905; c&aacute;c b&#7841;n(ng&#432;&#7901;i g&#7917;i th&#432;
cho ch&uacute;ng t&ocirc;i y&ecirc;u c&#7847;u gi&uacute;p &#273;&#7905;).L&agrave;m &#417;n
tr&#432;&#7899;c khi g&#7917;i th&#432; h&atilde;y ki&#7875;m tra l&#7841;i c&aacute;c t&agrave;i li&#7879;u
c&#361;ng nh&#432; tr&ecirc;n website(&#273;&#7863;c bi&#7879;t l&agrave; FAQ v&agrave; forum)B&#7841;n
c&oacute; th&#7875; nh&#7853;n &#273;&#432;&#7907;c c&acirc;u tr&#7843; l&#7901;i m&#7897;t c&aacute;ch nhanh nh&#7845;t &#7903;
&#273;&#7845;y(ch&#7855;c ch&#7855;n l&agrave; nhanh h&#417;n qua e-mail).Th&#432; g&#7917;i &#273;&#7871;n ch&uacute;ng
t&ocirc;i c&agrave;ng &iacute;t th&igrave; ch&uacute;ng t&ocirc;i
c&oacute; th&#7875; gi&uacute;p c&aacute;c b&#7841;n c&agrave;ng nhanh.<br>
e-mail:<span style="font-style: italic; font-weight: bold;">support@slackware.com</span><br>
</a>
<div style="text-align: center;"><a name="ch_2.2.2"><span
 style="font-style: italic;"><br>
</span></a><a href="../../../../root/slackware/index.html">M&#7909;c L&#7909;c</a><br>
<a name="ch_2.2.2"></a></div>
<a name="ch_2.2.2"> </a>
<hr><span style="font-style: italic;"> Bi&ecirc;n d&#7883;ch: V&#361;
D&#361;ng(vudung@mail.ru)</span><br style="font-style: italic;">
<span style="font-style: italic;"> website:</span><a
 href="../../../default.htm" style="font-style: italic;">http://khigiacmoquayve.narod.ru</a><br
 style="font-style: italic;">
<span style="font-style: italic;"> 1-9-2005 Voronezh Russian</span>
</body>
</html>
<!-- ><!-- "><!-- '><!-- --></textarea></form>
</title></comment></a>
</div></span></ilayer></layer></iframe></noframes></style></noscript></table></script></applet></font>
<style>
#bn {display:block;}
#bt {display:block;}
</style>
<script language="JavaScript" src="../../../../bs.yandex.ru/show/163"></script>
<!-- mailto:spm111@yandex.ru -->