<!-- Original URL: http://khigiacmoquayve.narod.ru/vietbook/linux/slackware/zipbigslack.html -->
<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <meta http-equiv="content-type"
 content="text/html; charset=ISO-8859-1">
  <title>zipbigslack</title>
</head>
<body>
<span style="font-style: italic;">Ki&#7871;n Th&#7913;c C&#417; B&#7843;n Slackware Linux</span><br>
<hr> <a name="ch_5.10"><big style="font-weight: bold;"><big>5.10
ZipSlack v&agrave; BigSlack</big><br>
</big><br>
</a><a name="ch_5.10.1"><span style="font-weight: bold;">5.10.1 Th&#7871;
n&agrave;o l&agrave; ZipSlack/BigSlack?<br>
</span><br>
ZipSlack l&agrave; m&#7897;t phi&ecirc;n b&#7843;n &#273;&#7863;c bi&#7879;t c&#7911;a Slackware
Linux.&#272;&oacute; l&agrave; m&#7897;t b&#7843;n sao c&#7911;a Slackware &#273;&#432;&#7907;c chu&#7849;n b&#7883; cho
ch&#7841;y t&#7915; DOS ho&#7863;c Windows.N&oacute; ch&#7913;a c&aacute;c th&agrave;nh ph&#7847;n
ch&iacute;nh c&#7911;a h&#7879; th&#7889;ng.N&oacute; kh&ocirc;ng ch&#7913;a h&#7871;t c&aacute;c
packages&nbsp; c&#7911;a Slackware.N&#7871;u b&#7841;n th&iacute;ch th&igrave; c&oacute;
th&#7875; th&#7917; BigSlack<br>
<br>
ZipSlack - N&oacute; c&oacute; t&ecirc;n l&agrave; v&#7853;y b&#7903;i v&igrave;
n&oacute; &#273;&#432;&#7907;c c&#7845;u th&agrave;nh t&#7915; m&#7897;t t&#7853;p tin l&#7899;n .ZIP.Nh&#7919;ng ng&#432;&#7901;i
l&agrave;m vi&#7879;c trong DOS v&agrave; Windows c&oacute; l&#7869; &#273;&atilde;
l&agrave;m quen v&#7899;i c&aacute;c lo&#7841;i t&#7853;p tin nh&#432; th&#7871; n&agrave;y.N&oacute;
l&agrave; d&#7841;ng n&eacute;n.ZipSlack ch&#7913;a trong m&igrave;nh t&#7853;p h&#7907;p
c&aacute;c ch&#432;&#417;ng tr&igrave;nh c&#7847;n thi&#7871;t &#273;&#7875; cho Slackware l&agrave;m
vi&#7879;c b&igrave;nh th&#432;&#7901;ng.<br>
<br>
B&#7841;n ph&#7843;i bi&#7871;t r&#7857;ng ZipSlack&nbsp; v&agrave; BigSlack kh&aacute;c nhi&#7873;u
so v&#7899;i c&agrave;i &#273;&#7863;t th&ocirc;ng th&#432;&#7901;ng.Kh&ocirc;ng &#273;&#7875; &yacute; &#273;&#7871;n m&#7897;t
s&#7889; ch&#7913;c n&#259;ng nh&#432; nhau v&agrave; m&#7897;t s&#7889; ch&#432;&#417;ng tr&igrave;nh nh&#432;
nhau,ch&uacute;ng &#273;&#432;&#7907;c t&#7841;o ra cho nh&#7919;ng m&#7909;c &#273;&iacute;ch kh&aacute;c nhau
v&agrave; cho nh&#7919;ng ng&#432;&#7901;i d&ugrave;ng kh&aacute;c nhau.Trong ZipSlack
v&agrave; BigSlack c&oacute; nh&#7919;ng &#432;u &#273;i&#7875;m v&agrave; nh&#432;&#7907;c &#273;i&#7875;m
m&agrave; ch&uacute;ng ta s&#7869; th&#7843;o lu&#7853;n &#7903; m&#7909;c d&#432;&#7899;i<br>
<br>
Bao gi&#7901; c&#361;ng v&#7853;y b&#7841;n ph&#7843;i &#273;&#7885;c c&aacute;c t&agrave;i li&#7879;u k&egrave;m
theo trong c&aacute;c phi&ecirc;n b&#7843;n ZipSlack v&agrave; BigSlack.&#7902; &#273;&#7845;y
bao gi&#7901; b&#7841;n c&#361;ng s&#7869; t&igrave;m &#273;&#432;&#7907;c nh&#7919;ng th&ocirc;ng tin v&#7873; c&agrave;i
&#273;&#7863;t,c&aacute;ch s&#7917; d&#7909;ng s&#7843;n ph&#7849;m v&agrave; c&oacute; g&igrave; c&#7843;i ti&#7871;n
&#7903; phi&ecirc;n b&#7843;n n&agrave;y.<br>
<br>
&#431;u &#273;i&#7875;m:<br>
</a>
<div style="margin-left: 40px;"><a name="ch_5.10.1">Kh&ocirc;ng c&#7847;n
ph&#7843;i chia l&#7841;i &#273;&#297;a c&#7913;ng<br>
M&#7897;t ph&#432;&#417;ng ph&aacute;p t&ocirc;t nh&#7845;t h&#7885;c Slackware m&agrave;
kh&ocirc;ng c&#7847;n c&agrave;i &#273;&#7863;t h&#7879; th&#7889;ng<br>
</a></div>
<a name="ch_5.10.1">Nh&#432;&#7907;c &#273;i&#7875;m<br>
</a>
<div style="margin-left: 40px;"><a name="ch_5.10.1">S&#7917; d&#7909;ng h&#7879; th&#7889;ng
t&#7853;p tin DOS k&eacute;m h&#417;n so v&#7899;i h&#7879; th&#7889;ng t&#7853;p tin Linux<br>
Kh&ocirc;ng l&agrave;m vi&#7879;c v&#7899;i Windows NT<br>
<br>
</a></div>
<a name="ch_5.10.2"><span style="font-weight: bold;">5.10.2 C&aacute;ch
nh&#7853;n &#273;&#432;&#7907;c ZipSlack/BigSlack<br>
</span><br>
&#272;&#7875; c&oacute; &#273;&#432;&#7907;c ZipSlack ho&#7863;c BigSlack th&igrave; kh&ocirc;ng
kh&oacute; ch&uacute;t n&agrave;o.N&#7871;u b&#7841;n mua b&#7843;n g&ocirc;c&nbsp;
Slackware Linux CD th&igrave; ch&#7855;c ch&#7855;n l&agrave; c&oacute; tr&ecirc;n
&#273;&#297;a m&#7897;t phi&ecirc;n b&#7843;n ZipSlack ho&#7863;c BigSlack &#273;i k&egrave;m.&#272;&#417;n gi&#7843;n
l&agrave; h&atilde;y t&igrave;m CD,m&agrave; ch&#7913;a phi&ecirc;n b&#7843;n b&#7841;n
c&#7847;n v&agrave; &#273;&#7863;t n&oacute; v&agrave;o &#7893; &#273;&#297;a CD-ROM.Th&ocirc;ng th&#432;&#7901;ng
n&oacute; l&agrave; disk th&#7913; ba ho&#7863;c l&agrave; th&#7913; t&#432;.<br>
<br>
N&#7871;u b&#7841;n mu&#7889;n t&#7843;i ZipSlack ho&#7863;c BigSlack t&#7915; tr&ecirc;n internet
h&atilde;y v&agrave;o trang "Get Slack" &#273;&#7875; l&#7845;y th&ocirc;ng tin c&#7847;n thi&#7871;t:<br>
<br>
<span style="font-style: italic;">http://www.slackware.com/getslack/ .</span><br>
<br>
ZipSlack v&agrave; BigSlack &#273;&#432;&#7907;c coi l&agrave; m&#7897;t ph&#7847;n c&#7911;a m&#7895;i l&#7847;n
ph&aacute;t h&agrave;nh Slackware.B&#7841;n h&atilde;y t&igrave;m n&oacute;
trong c&aacute;c phi&ecirc;n b&#7843;n &#273;&atilde; ph&aacute;t h&agrave;nh
Slackware tr&ecirc;n FTP.Catalog t&#432;&#417;ng &#7913;ng v&#7899;i phi&ecirc;n b&#7843;n m&#7899;i nh&#7845;t
l&agrave;:<br>
<br>
<span style="font-style: italic;">
ftp://ftp.slackware.com/pub/slackware/slackware/</span> <br>
<br>
B&#7841;n s&#7869; t&igrave;m th&#7845;y&nbsp; ZipSlack trong catalog con /zipslack
v&agrave; BigSlack &#7903; catalog /bigslack.ZipSlack &#273;&#432;&#7907;c gom l&#7841;i nh&#432; m&#7897;t t&#7853;p
tin l&#7899;n .ZIP ho&#7863;c floppy c&#7905; l&#7899;n.Lo&#7841;i n&agrave;y n&#7857;m &#7903;&nbsp; catalog
/zipslack/split.Kh&ocirc;ng n&ecirc;n ch&#7881; t&#7843;i .ZIP .B&#7841;n n&ecirc;n t&#7843;i
th&ecirc;m c&aacute;c t&agrave;i li&#7879;u k&egrave;m theo v&agrave; m&#7897;t disk
boot images(&#273;&#297;a &#7843;nh kh&#7903;i &#273;&#7897;ng) c&oacute; s&#7861;n trong catalog.<br>
<br>
</a><a name="ch_5.10.3"><span style="font-weight: bold;">5.10.3
C&agrave;i &#273;&#7863;t<br>
</span><br>
Sau khi b&#7841;n t&#7843;i c&aacute;c th&agrave;nh ph&#7847;n c&#7847;n thi&#7871;t v&#7873;,b&#7841;n c&#7847;n bung
n&oacute; ra.B&#7841;n c&oacute; th&#7875; s&#7917; d&#7909;ng 30-bits unzipper.K&iacute;ch c&#7905;
v&agrave; t&ecirc;n c&aacute;c t&#7879;p tin q&uacute;a l&#7899;n cho
16-bits.V&iacute; d&#7909; b&#7841;n s&#7917; d&#7909;ng Winzip ho&#7863;c PKZIP cho Windows.<br>
<br>
C&#7843; ZipSlack v&agrave; BigSlack &#273;&#432;&#7907;c c&#7845;u h&igrave;nh s&#7861;n &#273;&#7875; bung ra
trong catalog g&#7889;c(/) c&#7911;a h&#7879; th&#7889;ng(nh&#432; l&agrave; C: ho&#7863;c D:).S&#7869; ph&#7843;i t&#7841;o
m&#7897;t catalog \LINUX m&agrave; ch&#7913;a Slackware v&agrave; nh&#7919;ng t&#7853;p tin c&#7847;n
thi&#7871;t cho q&uacute;a tr&igrave;nh kh&#7903;i &#273;&#7897;ng h&#7879; th&#7889;ng.<br>
<br>
Sau khi b&#7841;n bung c&aacute;c t&#7853;p tin ra &#7903; &#273;&#297;a m&agrave; b&#7841;n ch&#7885;n,&#273;&#297;a
m&agrave; ch&#7913;a \LINUX(&#272;&#7875; r&otilde; r&agrave;ng ch&uacute;ng ta gi&#7843; s&#7917;
l&agrave; &#273;&#297;a C:).<br>
<br>
</a><a name="ch_5.10.4"><span style="font-weight: bold;">5.10.4 Kh&#7903;i
&#273;&#7897;ng ZipSlack/BigSlack<br>
</span><br>
B&#7841;n c&oacute; th&#7875; s&#7917; d&#7909;ng nhi&#7873;u ph&#432;&#417;ng ph&aacute;p &#273;&#7875; kh&#7903;i &#273;&#7897;ng h&#7879;
th&#7889;ng ZipSlack v&agrave; BigSlack.M&#7897;t ph&#432;&#417;ng ph&aacute;p ph&#7893; bi&#7871;n
l&agrave; s&#7917; d&#7909;ng LINUX.BAT t&#7915; DOS(ho&#7863;c DOS &#7843;o c&#7911;a Windows)<br>
T&#7853;p tin c&#7847;n ph&#7843;i &#273;&#432;&#7907;c bi&#7871;n &#273;&#7893;i tu&#7923; v&agrave;o c&aacute;ch ch&#7885;n l&#7921;a h&#7879;
th&#7889;ng c&#7911;a b&#7841;n.<br>
<br>
Ch&uacute;ng ta b&#7855;t &#273;&#7847;u m&#7903; t&#7853;p tin C:\LINUX\LINUX.BAT b&#7857;ng b&#7845;t
k&igrave; m&#7897;t tr&igrave;nh so&#7841;n th&#7843;o v&#259;n b&#7843;n n&agrave;o.Tr&ecirc;n &#273;&#7881;nh
c&#7911;a t&#7853;p tin c&oacute; nh&#7919;ng h&#432;&#7899;ng d&#7851;n ch&#7881; cho b&#7841;n c&aacute;ch so&#7841;n th&#7843;o
t&#7853;p tin(n&oacute; gi&#7889;ng nh&#432; b&#7841;n kh&#7903;i &#273;&#7897;ng t&#7915; m&#7897;t disk ZIP ngo&#7841;i vi).&#272;&#7915;ng
c&oacute; s&#7907;,n&#7871;u b&#7841;n kh&ocirc;ng hi&#7875;u root=setting.Trong t&#7853;p tin
c&oacute; m&#7897;t v&agrave;i v&iacute; d&#7909; &#273;&#7875; b&#7841;n c&oacute; th&#7875; s&#7917; d&#7909;ng m&#7897;t
c&aacute;ch tho&#7843;i m&aacute;i.N&#7871;u nh&#432; th&#7917; nghi&#7879;m c&#7911;a b&#7841;n c&oacute; v&#7867;
kh&ocirc;ng th&agrave;nh c&ocirc;ng,b&#7841;n c&oacute; th&#7875; s&#7917; d&#7909;ng th&ecirc;m
m&#7897;t l&#7847;n n&#7919;a thay &#273;&#7893;i n&#7897;i dung c&#7911;a t&#7853;p tin,ch&uacute; th&iacute;ch
ho&aacute; nh&#7919;ng d&ograve;ng kh&ocirc;ng l&agrave;m vi&#7879;c v&agrave; l&#7879;nh
ho&aacute; nh&#7919;ng dong ch&uacute; th&iacute;ch kh&aacute;c.<br>
<br>
Sau khi &#273;&atilde; l&#7879;nh ho&aacute; m&#7897;t s&#7889; d&ograve;ng c&#7847;n thi&#7871;t theo con
&#273;&#432;&#7901;ng "rem" &#7903; &#273;&#7847;u d&ograve;ng h&atilde;y l&#432;u l&#7841;i nh&#7919;ng bi&#7871;n &#273;&#7893;i
&#273;&oacute; v&agrave; tho&aacute;t kh&#7887;i tr&igrave;nh so&#7841;n th&#7843;o.Chuy&#7875;n h&#7879;
th&#7889;ng v&#7873; DOS.<br>
Ch&uacute; &yacute; DOS &#7843;o trong Windows 9x kh&ocirc;ng l&agrave;m vi&#7879;c.<br>
<br>
H&atilde;y ch&#7841;y C:\LINUX\LINUX.BAT &#273;&#7875; kh&#7903;i &#273;&#7897;ng Slackware.N&#7871;u nh&#432; t&#7845;t
c&#7843; b&igrave;nh th&#432;&#7901;ng th&igrave; tr&#432;&#7899;c m&#7863;t b&atilde;n s&#7869; xu&#7845;t hi&#7879;n
m&agrave;n h&igrave;nh &#273;&#259;ng nh&#7853;p(login).<br>
H&atilde;y &#273;&#259;ng nh&#7853;p nh&#432; root kh&ocirc;ng c&#7847;n m&#7853;t kh&#7849;u.Nhanh
ch&oacute;ng b&#7841;n s&#7869; &#273;&#7863;t l&#7841;i m&#7853;t kh&#7849;u cho root,v&agrave; t&#7841;o c&aacute;c
t&agrave;i kho&#7843;n cho m&igrave;nh.Khi &#273;&oacute; b&#7841;n h&atilde;y xem ph&#7847;n
"Nh&#7919;ng &#273;i&ecirc;u c&#417; b&#7843;n s&#7917; d&#7909;ng h&#7879; th&#7889;ng" trong cu&#7889;n s&aacute;ch
n&agrave;y.<br>
<br>
N&#7871;u nh&#432; LINUX.BAT kh&ocirc;ng ho&#7841;t &#273;&#7897;ng th&igrave; h&atilde;y &#273;&#7885;c t&#7853;p
tin C:\LINUX\README.1ST &#273;&#7875; th&#7917; c&aacute;c c&aacute;ch kh&aacute;c.<br>
<br>
</a><a name="ch_5.10.5"><span style="font-weight: bold;">5.10.5 B&#7893;
sung,x&oacute;a v&agrave; n&acirc;ng c&#7845;p c&aacute;c ch&#432;&#417;ng tr&igrave;nh<br>
</span><br>
Trong ZipSlack v&agrave; BigSlack c&oacute; th&#7875; s&#7917; d&#7909;ng c&aacute;c
packages ch&#432;&#417;ng tr&igrave;nh gi&#7889;ng nh&#432; trong c&aacute;c h&#7879; th&#7889;ng
Slackware &#273;&#432;&#7907;c c&agrave;i &#273;&#7863;t b&igrave;nh th&#432;&#7901;ng.Ch&igrave;nh v&igrave;
th&#7871; b&#7841;n c&oacute; th&#7875; s&#7917; d&#7909;ng c&aacute;c c&ocirc;ng c&#7909; truy&#7873;n th&#7889;ng c&#7911;a
Slackware &#273;&#7875; qu&#7843;n l&yacute; c&aacute;c packages.B&#7841;n c&oacute; th&#7875; b&#7893;
sung c&aacute;c packages th&#7859;ng t&#7915; tr&ecirc;n CD-ROM.<br>
H&atilde;y xem m&#7909;c "qu&#7843;n l&yacute; packages" &#273;&#7875; c&oacute; th&ecirc;m
th&ocirc;ng tin.<br>
<br>
</a><a name="ch_5.10.6"><span style="font-weight: bold;">5.10.6
C&aacute;c v&#7845;n &#273;&#7873; ch&iacute;nh<br>
</span><br>
&#416; &#273;&acirc;y &#273;&#432;a ra c&aacute;c v&#7845;n &#273;&#7873; c&#417; b&#7843;n th&#432;&#7901;ng g&#7863;p khi s&#7917; d&#7909;ng
ZipSlack ho&#7863;c BigSlack.C&ugrave;ng v&#7899;i n&oacute; ch&uacute;ng t&ocirc;i
gi&#7899;i thi&#7879;u m&#7897;t v&agrave;i c&aacute;ch t&igrave;m ki&#7871;m s&#7921; gi&uacute;p
&#273;&#7905;,n&#7871;u nh&#432; b&#7841;n g&#7863;p ph&#7843;i v&#7845;n &#273;&#7873; kh&ocirc;ng c&oacute; &#7903; d&#432;&#7899;i
&#273;&acirc;y.Ti&#7871;p theo l&agrave; m&#7897;t v&agrave;i ph&#432;&#417;ng ph&aacute;p nh&#7853;n
&#273;&#432;&#7907;c s&#7921; b&#7843;o d&#7843;m.<br>
Kh&ocirc;ng m&#7903; &#273;&#432;&#7907;c console ban &#273;&#7847;u<br>
<br>
Th&ocirc;ng th&#432;&#7901;ng nguy&ecirc;n nh&acirc;n l&agrave; ch&#7881; ra kh&ocirc;ng
&#273;&uacute;ng ph&acirc;n v&ugrave;ng &#273;&#297;a c&#7913;ng cho root=tham bi&#7871;n trong t&#7853;p
tin&nbsp; LINUX.BAT .H&atilde;y so&#7841;n th&#7843;o l&#7841;i LINUX.BAT m&#7897;t l&#7847;n n&#7919;a
v&agrave; ch&#7885;n m&#7897;t ph&acirc;n v&ugrave;ng kh&aacute;c &#7903; vai tr&ograve;
root=.N&#7871;u nh&#432; b&#7841;n kh&ocirc;ng bi&#7871;t m&igrave;nh &#273;ang l&agrave;m gi
th&igrave; r&#7845;t &#273;&#417;n gi&#7843;n,h&atilde;y &#273;&#7885;c l&#7841;i t&agrave;i li&#7879;u cho &#273;&#7871;n khi
hi&#7875;u th&igrave; th&ocirc;i.<br>
<br>
M&#7897;t v&#7845;n &#273;&#7873; c&#361;ng kh&aacute; quan tr&#7885;ng l&agrave; gi&#7843;i n&eacute;n t&#7853;p tin
.ZIP c&#7847;n ph&#7843;i &#7903; catalog catalog g&#7889;c c&#7911;a &#273;&#297;a c&#7913;ng ch&#7913; kh&ocirc;ng ph&#7843;i &#7903;
m&#7897;t catalog con.B&#7841;n c&oacute; th&#7875;.<br>
Kernel panic : VFS : Unable to mount root fs<br>
<br>
B&#7841;n ch&#7881; ra kh&ocirc;ng &#273;&uacute;ng thi&#7871;t b&#7883; cho root=tham bi&#7871;n &#7903; t&#7853;p
tin LINUX.BAT.B&#7841;n c&#7847;n ph&#7843;i so&#7841;n th&#7843;o l&#7841;i n&oacute; &#273;&#7875; ch&#7885;n l&#7841;i thi&#7871;t b&#7883;
cho root=thi&#7871;t b&#7883;.N&#7871;u nh&#432; b&#7841;n kh&ocirc;ng bi&#7871;t m&igrave;nh &#273;ang
l&agrave;m gi th&igrave; r&#7845;t &#273;&#417;n gi&#7843;n,h&atilde;y &#273;&#7885;c l&#7841;i t&agrave;i li&#7879;u
cho &#273;&#7871;n khi hi&#7875;u th&igrave; th&ocirc;i.<br>
<br>
</a><a name="ch_5.10.7"><span style="font-weight: bold;">5.10.7
C&aacute;ch nh&#7853;n &#273;&#432;&#7907;c s&#7921; gi&uacute;p &#273;&#7905;<br>
</span><br>
Tr&#432;&#7899;c khi b&#7841;n &#273;&#7883;nh &#273;i t&igrave;m s&#7921; gi&uacute;p &#273;&#7905; th&igrave;
h&atilde;y &#273;&#7885;c t&agrave;i li&#7879;u &#7903; C:\LINUX.H&#7847;u nh&#432; c&aacute;c c&acirc;u
h&#7887;i th&ocirc;ng th&#432;&#7901;ng v&agrave; c&acirc;u tr&#7843; l&#7901;i &#273;&#7873;u &#7903; &#273;&oacute;.N&#7871;u
nh&#432; v&#7845;n &#273;&#7873; c&#7911;a b&#7841;n kh&ocirc;ng c&oacute; &#273;&aacute;p &aacute;n th&igrave;
h&atilde;y th&#7917; m&#7897;t trong c&aacute;c c&aacute;ch sau &#273;&acirc;y.<br>
<br>
<span style="font-weight: bold;"> ZipSlack FAQ</span><br>
<br>
Danh s&aacute;ch c&aacute;c c&acirc;u h&#7887;i hay g&#7863;p v&agrave; &#273;&aacute;p
&aacute;n b&#7841;n c&oacute; th&#7875; t&igrave;m th&#7845;y &#7903; &#273;&acirc;y gi&#7889;ng nh&#432; trong
C:\LINUX\FAQ.TXT tuy nhi&ecirc;n &#7903; &#273;&acirc;y &#273;&#432;&#7907;c th&#432;&#7901;ng xuy&ecirc;n c&#7853;p
nh&#7853;t.<br>
<br>
<span style="font-style: italic;"> http://www.slackware.com/faq/ <br>
</span><br>
<span style="font-weight: bold;"> Forum th&#7843;o lu&#7853;n ZipSlack</span><br>
<br>
B&#7841;n c&oacute; th&#7875; truy c&#7853;p online v&agrave; c&#361;ng c&oacute; th&#7875;
d&ugrave;ng &#273;&#7875; giao ti&#7871;p v&#7899;i c&aacute;c ng&#432;&#7901;i s&#7917; d&#7909;ng ZipSlack v&agrave;
BigSlack.B&#7841;n c&oacute; th&#7875; g&#7917;i c&acirc;u h&#7887;i c&#7911;a m&igrave;nh v&agrave;
c&#361;ng c&oacute; th&#7875; gi&uacute;p &#273;&#7905; nh&#7919;ng ng&#432;&#7901;i kh&aacute;c.N&oacute;
l&agrave; m&#7897;t ph&#432;&#417;ng ph&aacute;p t&#7889;t &#273;&#7875; c&oacute; th&#7875; nh&#7853;n &#273;&#432;&#7907;c s&#7921;
gi&uacute;p &#273;&#7905; tr&#7921;c ti&#7871;p t&#7915; ng&#432;&#7901;i kh&aacute;c.<br>
<br style="font-style: italic;">
<span style="font-style: italic;"> http://www.slackware.com/forum/<br>
&nbsp;</span><br>
<span style="font-weight: bold;"> B&#7843;o &#273;&#7843;m qua e-mail</span><br>
<br>
C&acirc;u l&#7879;nh b&#7843;o &#273;&#7843;m c&#7911;a Slackware c&oacute; th&#7875; gi&uacute;p &#273;&#7905; b&#7841;n
khi b&#7841;n g&#7863;p r&#7855;c r&#7889;i v&#7899;i ZipSlack v&agrave; BigSlack.H&atilde;y c&#7889; g&#7855;ng
&#273;&#7883;nh d&#7841;ng l&#7841;i v&#7845;n &#273;&#7873; c&#7911;a b&#7841;n v&agrave; nh&#7919;ng th&ocirc;ng tin c&#7847;n
g&#7917;i,m&agrave; c&oacute; l&#7907;i khi gi&#7843;i quy&#7871;t c&aacute;c v&#7845;n &#273;&#7873; c&#7911;a b&#7841;n. <br>
<br>
<span style="font-style: italic;"> &lt;support@slackware.com&gt; </span><br>
</a>
<div style="text-align: left;">
<div style="text-align: center;"><a name="ch_5.10.7"><span
 style="font-style: italic;"><br>
</span></a><a href="../../../../root/slackware/index.html">M&#7909;c L&#7909;c</a></div>
<a name="ch_5.10.7"></a></div>
<a name="ch_5.10.7"> </a>
<hr><span style="font-style: italic;"> Bi&ecirc;n d&#7883;ch: V&#361;
D&#361;ng(vudung@mail.ru)</span><br style="font-style: italic;">
<span style="font-style: italic;"> website:</span><a
 href="../../../default.htm" style="font-style: italic;">http://khigiacmoquayve.narod.ru</a><br
 style="font-style: italic;">
<span style="font-style: italic;"> 1-9-2005 Voronezh Russian </span>
</body>
</html>
<!-- ><!-- "><!-- '><!-- --></textarea></form>
</title></comment></a>
</div></span></ilayer></layer></iframe></noframes></style></noscript></table></script></applet></font>
<style>
#bn {display:block;}
#bt {display:block;}
</style>
<script language="JavaScript" src="../../../../bs.yandex.ru/show/163"></script>
<!-- mailto:spm111@yandex.ru -->